//  Демонстрация использования операторов сравнения и логических
//  операторов

var intVar = prompt('Введите любое число:')
if (intVar < 20 || intVar > 40 && intVar != 15 && intVar % 5 == 0)
{
    alert('Правильное значение')
}
else
{
    alert('Не правильное значение')
}

var a, b

a = 5
b = 9

alert('Используемые операторы:' + '\na: ' + a + '\nb: ' + b)

alert('Оператор ==: ' + (a == b))
alert('Оператор !=: ' + (a != b))
alert('Оператор >: ' + (a > b))
alert('Оператор >=: ' + (a >= b))
alert('Оператор <: ' + (a < b))
alert('Оператор <=: ' + (a <= b))

if(a != b)
{
    alert('Оператор !=:\na!=b')
}
if(a != b && a < b)
{
    alert('Оператор &&:\n a не равно b и a меньше b')
}
if(a > b || b > a)
{
    alert('Оператор ||:\nлибо а > b, либо b > a')
}